In [18]:
import pandas as pd

In [19]:
grades_dict = {'Wally': [87, 96, 70],
                'Eva': [100, 87, 90],
                'Sam': [94, 77, 90],
                'Katie': [100, 81, 82],
                'Bob': [83, 65, 85]}

grades = pd.DataFrame(grades_dict)
grades.index = ['Test1', 'Test2', 'Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [20]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

loc
iloc - uses integer indexing (non inclusive of upper limit indeces)
at
iat - similar to iloc

In [21]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [23]:
grades.iloc[0] # Test1

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [28]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [29]:
grades.iloc[0:2] #not inclusive of upper bound

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [30]:
grades.loc[['Test1', 'Test3']] # non consecutive rows

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [39]:
#View only Eva and Kate's grades on test1 and test2

# loc[row, column]
grades.loc['Test1':'Test2', ['Eva', 'Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

Boolean Indexing

In [40]:
grades[grades>=90]

       Wally    Eva   Sam  Katie  Bob
Test1    NaN  100.0  94.0  100.0  NaN
Test2   96.0    NaN   NaN    NaN  NaN
Test3    NaN   90.0  90.0    NaN  NaN

In [41]:
grades[(grades >= 80) & (grades < 90)]  # for the 'OR' operation it is the '|' symbol

       Wally   Eva  Sam  Katie   Bob
Test1   87.0   NaN  NaN    NaN  83.0
Test2    NaN  87.0  NaN   81.0   NaN
Test3    NaN   NaN  NaN   82.0  85.0

In [42]:
grades.at['Test2', 'Eva'] # can only give it a specific row and column. RETURNS A SINGLE VALUE

87

In [45]:
grades.at['Test2', 'Eva'] = 100
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96  100   77     81   65
Test3     70   90   90     82   85

In [47]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   96.666667  87.000000   87.666667  77.666667
std    13.203535    5.773503   8.888194   10.692677  11.015141
min    70.000000   90.000000  77.000000   81.000000  65.000000
25%    78.500000   95.000000  83.500000   81.500000  74.000000
50%    87.000000  100.000000  90.000000   82.000000  83.000000
75%    91.500000  100.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [48]:
pd.set_option('display.precision', 2)
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   96.67  87.00   87.67  77.67
std    13.20    5.77   8.89   10.69  11.02
min    70.00   90.00  77.00   81.00  65.00
25%    78.50   95.00  83.50   81.50  74.00
50%    87.00  100.00  90.00   82.00  83.00
75%    91.50  100.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [49]:
grades.mean()

Wally    84.33
Eva      96.67
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [50]:
grades.T

       Test1  Test2  Test3
Wally     87     96     70
Eva      100    100     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

In [51]:
grades.T.describe()

        Test1   Test2  Test3
count    5.00    5.00   5.00
mean    92.80   83.80  83.40
std      7.66   14.31   8.23
min     83.00   65.00  70.00
25%     87.00   77.00  82.00
50%     94.00   81.00  85.00
75%    100.00   96.00  90.00
max    100.00  100.00  90.00

Sorting Rows by their indices

In [56]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96  100   77     81   65
Test1     87  100   94    100   83

In [58]:
grades.sort_index(axis=1) # sorts by rows, and then columns

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65  100     81   77     96
Test3   85   90     82   90     70

In [61]:
grades.sort_values(by='Test1', axis=1, ascending=False)

       Eva  Katie  Sam  Wally  Bob
Test1  100    100   94     87   83
Test2  100     81   77     96   65
Test3   90     82   90     70   85

In [62]:
grades.T.sort_values(by='Test1', ascending=False)

       Test1  Test2  Test3
Eva      100    100     90
Katie    100     81     82
Sam       94     77     90
Wally     87     96     70
Bob       83     65     85

In [65]:
grades.loc['Test1'].sort_values(ascending=False)

Eva      100
Katie    100
Sam       94
Wally     87
Bob       83
Name: Test1, dtype: int64